from config import OWNER_USERNAME, SUPPORT_GRP
from YUVICHATBOT import YUVICHATBOT
from pyrogram import Client, filters



START = """**
┌────── ˹ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ˼──────•
┆◍ ʜᴇʏ ᴛʜᴇʀᴇ!
└──────────────────────•
» ✦ ᴛʜᴇ ꜱᴜᴘᴇʀꜰᴀꜱᴛ ᴄʜᴀᴛʙᴏᴛ
» ✦ ꜱᴜᴘᴘᴏʀᴛꜱ ᴛᴇxᴛ, ꜱᴛɪᴄᴋᴇʀ, ᴘʜᴏᴛᴏ, ᴠɪᴅᴇᴏ
» ✦ ᴍᴜʟᴛɪ-ʟᴀɴɢᴜᴀɢᴇ ғᴏʀ ᴇᴀᴄʜ ᴄʜᴀᴛ
» ✦ ᴄʜᴀᴛʙᴏᴛ ᴇɴᴀʙʟᴇ/ᴅɪꜱᴀʙʟᴇ ʏᴏᴜʀ ᴡᴀʏ
» ✦ ᴄʀᴇᴀᴛᴇ ʏᴏᴜʀ ᴏᴡɴ ɪᴅ-ᴄʜᴀᴛʙᴏᴛ
•──────────────────────•
❖ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ➛ [ʏᴜᴠɪ ʙσᴛ](https://t.me/x_yuvii)
•──────────────────────•

**"""

HELP_READ = f"""**
```❖ ᴄʜσσsє ᴛʜє ᴄᴧᴛєɢσʀʏ ғσʀ ᴡʜɪᴄʜ ʏσυ ᴡᴧηηᴧ ɢєᴛ ʜєʟᴩ
ᴧsᴋ ʏσυʀ ᴅσυʙᴛs ᴧᴛ sυᴘᴘσʀᴛ ᴄʜᴧᴛ
ᴧʟʟ ᴄσϻϻᴧηᴅs ᴄᴧη ʙє υsєᴅ ᴡɪᴛʜ : /```**
"""

TOOLS_DATA_READ = f"""**
๏ ʜᴇʀᴇ ᴀʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ ᴛᴏᴏʟꜱ:

➻ /start ᴛᴏ ᴡᴀᴋᴇ ᴜᴘ ᴛʜᴇ ʙᴏᴛ ᴀɴᴅ ʀᴇᴄᴇɪᴠᴇ ᴀ ᴡᴇʟᴄᴏᴍᴇ ᴍᴇssᴀɢᴇ!
──────────────
➻ /help ғᴏʀ ɢᴇᴛᴛɪɴɢ ᴅᴇᴛᴀɪʟs ᴀʙᴏᴜᴛ ᴀʟʟ ᴄᴏᴍᴍᴀɴᴅs ᴀɴᴅ ғᴇᴀᴛᴜʀᴇs.
──────────────
➻ /ping ᴛᴏ ᴄʜᴇᴄᴋ ᴛʜᴇ ʀᴇsᴘᴏɴsᴇ ᴛɪᴍᴇ (ᴘɪɴɢ) ᴏғ ᴛʜᴇ ʙᴏᴛ!
──────────────
➻ /id ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ᴜsᴇʀ ɪᴅ, ᴄʜᴀᴛ ɪᴅ, ᴀɴᴅ ᴍᴇssᴀɢᴇ ɪᴅ ᴀʟʟ ɪɴ ᴏɴᴇ ᴍᴇssᴀɢᴇ.
──────────────
➻ /broadcast ᴛᴏ ғᴏʀᴡᴀʀᴅ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ᴀʟʟ ᴄʜᴀᴛs ʙᴀsᴇᴅ ᴏɴ sᴘᴇᴄɪғɪᴇᴅ ғʟᴀɢs!\nᴇxᴀᴍᴘʟᴇ: `/broadcast -user -pin ʜᴇʟʟᴏ ғʀɪᴇɴᴅs`
──────────────
➻ /shayri ɢᴇᴛ ʀᴀɴᴅᴏᴍ sʜᴀʏʀɪ ғᴏʀ ʏᴏᴜʀ ʟᴏᴠᴇ
──────────────
 **
"""

CHATBOT_READ = f"""**
๏ ʜᴇʀᴇ ᴀʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ ᴄʜᴀᴛʙᴏᴛ:

➻ /chatbot - ᴏᴘᴇɴs ᴏᴘᴛɪᴏns ᴛᴏ ᴇɴᴀʙʟᴇ ᴏʀ ᴅɪsᴀʙʟᴇ ᴛʜᴇ ᴄʜᴀᴛʙᴏᴛ.
──────────────
➻ /lang, /language, /setlang - ᴏᴘᴇɴs ᴀ ᴍᴇɴᴜ ᴛᴏ sᴇʟᴇᴄᴛ ᴛʜᴇ ᴄʜᴀᴛ ʟᴀɴɢᴜᴀɢᴇ.  
──────────────
➻ /resetlang, /nolang - ʀᴇsᴇᴛs ᴛʜᴇ ʙᴏᴛ's ʟᴀɴɢᴜᴀɢᴇ ᴛᴏ ᴍɪxᴇᴅ ʟᴀɴɢᴜᴀɢᴇ.
──────────────
➻ /chatlang - ɢᴇᴛ ᴄᴜʀʀᴇɴᴛ ᴜꜱɪɴɢ ᴄʜᴀᴛ ʟᴀɴɢ ꜰᴏʀ ᴄʜᴀᴛ.
──────────────
➻ /status - ᴄʜᴇᴄᴋ ᴄʜᴀᴛʙᴏᴛ ᴀᴄᴛɪᴠᴇ ᴏʀ ɴᴏᴛ.
──────────────
➻ /stats - ɢᴇᴛ ʙᴏᴛ ꜱᴛᴀᴛꜱ
──────────────


**
"""

SOURCE_READ = f"**❍ ʜᴇʏ, ᴛʜᴇ [{YUVICHATBOT.name}](https://t.me/{YUVICHATBOT.username}) ɪs ɴᴇᴡ ᴘᴏᴡᴇʀғᴜʟ ᴄʜᴀᴛʙᴏᴛ ᴏғ ᴡʜᴏʟᴇ ᴛᴇʟᴇɢʀᴀᴍ.**\n\n**❍ ɪғ ʏᴏᴜ ғᴀᴄᴇ ᴀɴʏ ᴘʀᴏʙʟᴇᴍ, ᴄᴏɴᴛᴀᴄᴛ ᴜs ɪɴ [sᴜᴘᴘᴏʀᴛ ᴄʜᴀᴛ]({SUPPORT_GRP}).**\n\n**❖ ᴜᴘᴅᴀᴛᴇs: [ʏᴜᴠɪ ᴜᴘᴅᴀᴛᴇs](https://t.me/XX_yuvii)**\n\n**💙 ᴘᴏᴡᴇʀᴇᴅ ʙʏ [ʏᴜᴠɪ](https://t.me/x_yuvii) **"

ADMIN_READ = f"""**
๏ ʜᴇʀᴇ ᴀʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ ᴄʟᴏɴᴇ ᴄʜᴀᴛʙᴏᴛ:

──────────────
➻ /clone [ ʙᴏᴛ ᴛᴏᴋᴇɴ ] - ᴛᴏ ᴄʟᴏɴᴇ ʏᴏᴜʀ ʙᴏᴛ.
──────────────
➻ /idclone [ ᴩʏʀᴏɢʀᴀᴍ ꜱᴛʀɪɴɢ ꜱᴇꜱꜱɪᴏɴ ] - ᴛᴏ ᴍᴀᴋᴇ ɪᴅ-ᴄʜᴀᴛʙᴏᴛ.
──────────────
➻ /delclone [ ʙᴏᴛ ᴛᴏᴋᴇɴ ] - ᴛᴏ ᴅᴇʟᴇᴛᴇ ʏᴏᴜʀ ᴄʟᴏɴᴇ ʙᴏᴛ.
──────────────
➻ /delidclone [ ᴩʏʀᴏɢʀᴀᴍ ꜱᴛʀɪɴɢ ꜱᴇꜱꜱɪᴏɴ ] - ᴛᴏ  ᴅᴇʟᴇᴛᴇ ʏᴏᴜʀ ɪᴅ-ᴄʜᴀᴛʙᴏᴛ.
──────────────

**"""

ABOUT_READ = f"""
**───────────────────────
❖ ɪ ʜᴧᴠє ϻσsᴛ ᴘσᴡєʀғυʟʟ υsєғυʟ ɢʀσυᴘ
    ᴄʜᴀᴛʙᴏᴛ + ᴄʟᴏɴᴇʀ ʙσᴛ ғєᴧᴛυʀєs
───────────────────────
● ᴡʀɪᴛᴛєη ɪη ᴩʏᴛʜση ᴡɪᴛʜ sǫʟᴧʟᴄʜєϻʏ
   ᴧηᴅ ϻσηɢσᴅʙ ᴧs ᴅᴧᴛᴧʙᴧsє
───────────────────────
● ɪ ᴄᴧη ʀєꜱᴛʀɪᴄᴛ υꜱєʀꜱ
● ɪ ʜᴧᴠє ᴧη ᴧᴅᴠᴧηᴄєᴅ ᴧηᴛɪ-ꜰʟσσᴅ ꜱʏꜱᴛєϻ
● ᴧᴅᴠᴧηᴄє ϻᴧηᴧɢєϻєηᴛ ᴄᴧᴘᴧʙɪʟɪᴛʏ
● ᴧηɪϻє ʙσᴛ ғυηᴄᴛɪσηᴧʟɪᴛʏ
● ᴧɪ ɪηᴛєɢʀᴧᴛɪση
───────────────────────
❖ υᴘᴅᴧᴛєs ᴄʜᴧηηєʟ ➥ [ʏᴜᴠɪ ᴜᴘᴅᴧᴛє](https://t.me/XX_yuvii)
❖ sυᴘᴘσʀᴛ ᴄʜᴧᴛ ➥ [ʏᴜᴠɪ sυᴘᴘσʀᴛ](https://t.me/+WY5qffrfZ1tjNTQ1)
❖ ʀєᴧʟ σᴡηєʀ ➥ [ʏᴜᴠɪ](https://t.me/x_yuvii)
❖ ʏᴜᴠɪ ᴘʀᴏᴊᴇᴄᴛ ➥ [ʏᴜᴠɪ ʙᴏᴛs](https://t.me/yuvi_botes)
───────────────────────
❖ ᴄʟɪᴄᴋ ση ᴛʜє ʜєʟᴩ ʙυᴛᴛση ᴛσ ɢєᴛ ɪηғσ
    ᴧʙσυᴛ ϻʏ ϻσᴅυʟєs ᴧηᴅ ᴄσϻϻᴧηᴅs...!
───────────────────────**
"""



RGAM = f"""
**⌯ ᴘʟᴧʏ ɢᴧϻє ⌯

❖ /dice ─ ᴅɪᴄє  
❖ /dart ─ ᴅᴧʀᴛ  
❖ /basket ─ ʙᴧsᴋєᴛ ʙᴧʟʟ  
❖ /ball ─ ʙσᴡʟɪηɢ ʙᴧʟʟ  
❖ /football ─ ғσσᴛʙᴧʟʟ  
❖ /jackpot ─ sᴘɪη sʟσᴛ ϻᴧᴄʜɪηє


```⌯ ᴛᴧɢ ᴧʟʟ ⌯```

❖ /tagall ─ ᴛᴧɢ ᴧʟʟ ϻєϻʙєʀs  
  
```⌯ ϻєϻє ғυη ⌯```

❖ /meme ─ sєηᴅ ʀᴧηᴅσϻ ϻєϻє  
**
"""
